# LAB 5: ACCESS CONTROL LISTS (ACL)
## –ö–æ–Ω—Ç—Ä–æ–ª –Ω–∞ –º—Ä–µ–∂–æ–≤–∏—è —Ç—Ä–∞—Ñ–∏–∫ –∏ —Å–∏–≥—É—Ä–Ω–æ—Å—Ç

**–¶–µ–ª:** –î–∞ —Å–µ –Ω–∞—É—á–∏—Ç–µ –¥–∞ —Å—ä–∑–¥–∞–≤–∞—Ç–µ –∏ –ø—Ä–∏–ª–∞–≥–∞—Ç–µ ACL –∑–∞ –∫–æ–Ω—Ç—Ä–æ–ª –Ω–∞ –¥–æ—Å—Ç—ä–ø–∞ –º–µ–∂–¥—É –º—Ä–µ–∂–∏ –∏ VLAN-–∏.

**–ü—Ä–æ–¥—ä–ª–∂–∏—Ç–µ–ª–Ω–æ—Å—Ç:** 75-90 –º–∏–Ω—É—Ç–∏

**–ü—Ä–µ–¥–≤–∞—Ä–∏—Ç–µ–ª–Ω–∏ –∏–∑–∏—Å–∫–≤–∞–Ω–∏—è:** –ó–∞–≤—ä—Ä—à–µ–Ω–∏ Lab 1-4 (–æ—Å–æ–±–µ–Ω–æ Lab 2 —Å VLAN-–∏)

---

## –©–û –ï –¢–û ACCESS CONTROL LIST (ACL)?

### –û—Å–Ω–æ–≤–Ω–∞ –∫–æ–Ω—Ü–µ–ø—Ü–∏—è

**ACL (Access Control List)** –µ **—Ñ–∏–ª—Ç—ä—Ä –∑–∞ –º—Ä–µ–∂–æ–≤ —Ç—Ä–∞—Ñ–∏–∫** - –∫–∞—Ç–æ –æ—Ö—Ä–∞–Ω–∏—Ç–µ–ª –Ω–∞ –≤—Ä–∞—Ç–∞, –∫–æ–π—Ç–æ –ø—Ä–æ–≤–µ—Ä—è–≤–∞ –∫–æ–π –º–æ–∂–µ –¥–∞ –≤–ª–µ–∑–µ –∏ –∫–æ–π –Ω–µ.

```
–ê–Ω–∞–ª–æ–≥–∏—è: ACL –µ –∫–∞—Ç–æ –Ω–æ—â–µ–Ω –∫–ª—É–± —Å—ä—Å —Å–ø–∏—Å—ä–∫ –Ω–∞ –≥–æ—Å—Ç–∏—Ç–µ

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ    üö™ ENTRANCE (Router)     ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ Bouncer (ACL):              ‚îÇ
‚îÇ                             ‚îÇ
‚îÇ ‚úÖ VIP John ‚Üí ALLOW         ‚îÇ
‚îÇ ‚ùå Troublemaker Bob ‚Üí DENY  ‚îÇ
‚îÇ ‚úÖ Everyone else ‚Üí ALLOW    ‚îÇ
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò
```

### –ó–∞—â–æ –∏–º–∞–º–µ –Ω—É–∂–¥–∞ –æ—Ç ACL?

**–ü—Ä–∏–º–µ—Ä–∏ –∑–∞ –∑–∞—â–∏—Ç–∞:**
- Guest VLAN –Ω–µ –º–æ–∂–µ –¥–∞ –¥–æ—Å—Ç—ä–ø–≤–∞ Admin Server ‚ùå
- IT VLAN –º–æ–∂–µ –¥–∞ –¥–æ—Å—Ç—ä–ø–≤–∞ –≤—Å–∏—á–∫–æ ‚úÖ
- –ë–ª–æ–∫–∏—Ä–∞–Ω–µ –Ω–∞ –∫–æ–Ω–∫—Ä–µ—Ç–Ω–∏ —Ö–æ—Å—Ç–æ–≤–µ
- –û–≥—Ä–∞–Ω–∏—á–∞–≤–∞–Ω–µ –Ω–∞ —É—Å–ª—É–≥–∏ (—Å–∞–º–æ HTTP, –Ω–µ Telnet)

---

## –í–ò–î–û–í–ï ACL - –°–†–ê–í–ù–ï–ù–ò–ï

| –•–∞—Ä–∞–∫—Ç–µ—Ä–∏—Å—Ç–∏–∫–∞ | Standard ACL | Extended ACL | Named ACL |
|----------------|-------------|--------------|-----------|
| **ACL –Ω–æ–º–µ—Ä–∞** | 1-99, 1300-1999 | 100-199, 2000-2699 | –ò–º–µ (—Ç–µ–∫—Å—Ç) |
| **–§–∏–ª—Ç—Ä–∏—Ä–∞ –ø–æ** | Source IP **–°–ê–ú–û** | Source, Dest, Protocol, Port | –ö–∞—Ç–æ Extended |
| **–ì—ä–≤–∫–∞–≤–æ—Å—Ç** | –û–≥—Ä–∞–Ω–∏—á–µ–Ω–∞ | –ú–Ω–æ–≥–æ –≥—ä–≤–∫–∞–≤ | –ù–∞–π-–≥—ä–≤–∫–∞–≤ |
| **–ö—ä–¥–µ –ø—Ä–∏–ª–∞–≥–∞–º–µ** | –ë–ª–∏–∑–æ –¥–æ **destination** | –ë–ª–∏–∑–æ –¥–æ **source** | –ö–∞—Ç–æ Extended |
| **–ü—Ä–∏–º–µ—Ä** | `access-list 10 deny host 192.168.10.11` | `access-list 100 permit tcp ... eq 80` | `ip access-list extended WEB_ACCESS` |
| **–ö–æ–≥–∞ –∏–∑–ø–æ–ª–∑–≤–∞–º–µ** | –ë–ª–æ–∫–∏—Ä–∞–Ω–µ –Ω–∞ —Ü–µ–ª–∏ –º—Ä–µ–∂–∏ | –î–µ—Ç–∞–π–ª–µ–Ω –∫–æ–Ω—Ç—Ä–æ–ª (port, protocol) | –ú–æ–¥–µ—Ä–µ–Ω –ø–æ–¥—Ö–æ–¥ (–ø—Ä–µ–ø–æ—Ä—ä—á–∏—Ç–µ–ª–µ–Ω) |

### Standard ACL –ø—Ä–∏–º–µ—Ä:
```cisco
access-list 10 deny host 192.168.10.11
access-list 10 permit any
```
**–ë–ª–æ–∫–∏—Ä–∞ –°–ê–ú–û –µ–¥–∏–Ω —Ö–æ—Å—Ç, –ø–æ–∑–≤–æ–ª—è–≤–∞ –≤—Å–∏—á–∫–∏ –æ—Å—Ç–∞–Ω–∞–ª–∏**

### Extended ACL –ø—Ä–∏–º–µ—Ä:
```cisco
access-list 100 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 80
access-list 100 deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
access-list 100 permit ip any any
```
**–ü–æ–∑–≤–æ–ª—è–≤–∞ —Å–∞–º–æ HTTP –æ—Ç IT –∫—ä–º Admin, –±–ª–æ–∫–∏—Ä–∞ –≤—Å–∏—á–∫–æ –æ—Å—Ç–∞–Ω–∞–ª–æ**

### Named ACL –ø—Ä–∏–º–µ—Ä:
```cisco
ip access-list extended WEB_ONLY
 remark Allow only HTTP and HTTPS
 permit tcp any any eq 80
 permit tcp any any eq 443
 deny ip any any
```
**–ü–æ-—á–µ—Ç–ª–∏–≤ –∏ –ª–µ—Å–µ–Ω –∑–∞ —Ä–µ–¥–∞–∫—Ü–∏—è**

---

## –©–û –ï –¢–û WILDCARD MASK?

### Subnet Mask vs Wildcard Mask

**Subnet Mask** –∏ **Wildcard Mask** —Å–∞ **–û–ë–†–ê–¢–ù–ò** –µ–¥–Ω–æ –Ω–∞ –¥—Ä—É–≥–æ!

| –ö–æ–Ω—Ü–µ–ø—Ü–∏—è | Subnet Mask | Wildcard Mask |
|-----------|-------------|---------------|
| **–¶–µ–ª** | –î–µ—Ñ–∏–Ω–∏—Ä–∞ –º—Ä–µ–∂–∞ | –î–µ—Ñ–∏–Ω–∏—Ä–∞ –∫–æ–∏ –±–∏—Ç–æ–≤–µ –¥–∞ —Å–µ **–∏–≥–Ω–æ—Ä–∏—Ä–∞—Ç** |
| **–õ–æ–≥–∏–∫–∞** | 1 = –ø—Ä–æ–≤–µ—Ä—è–≤–∞–π, 0 = –∏–≥–Ω–æ—Ä–∏—Ä–∞–π | 0 = –ø—Ä–æ–≤–µ—Ä—è–≤–∞–π, 1 = **–∏–≥–Ω–æ—Ä–∏—Ä–∞–π** |
| **–ü—Ä–∏–º–µ—Ä /24** | 255.255.255.0 | 0.0.0.255 |
| **–ò–∑–ø–æ–ª–∑–≤–∞–Ω–µ** | IP –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è | ACL —Ñ–∏–ª—Ç—Ä–∏—Ä–∞–Ω–µ |

### –ë—ä—Ä–∑–∞ —Ñ–æ—Ä–º—É–ª–∞:
```
Wildcard Mask = 255.255.255.255 - Subnet Mask

–ü—Ä–∏–º–µ—Ä:
Subnet Mask:  255.255.255.0
Wildcard:     255.255.255.255
            - 255.255.255.0
            ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ
            = 0.0.0.255 ‚úÖ
```

---

## –¢–†–ò –û–°–ù–û–í–ù–ò –ü–†–ò–ú–ï–†–ê –° WILDCARD

### –ü—Ä–∏–º–µ—Ä 1: –¶—è–ª–∞ –º—Ä–µ–∂–∞ /24

**–ò—Å–∫–∞–º–µ:** –í—Å–∏—á–∫–∏ –∞–¥—Ä–µ—Å–∏ –≤ 192.168.10.0/24

```
IP:       192.168.10.0
Wildcard: 0.0.0.255

–û–±—è—Å–Ω–µ–Ω–∏–µ:
- 0.0.0 ‚Üí –ü—ä—Ä–≤–∏—Ç–µ 3 –æ–∫—Ç–µ—Ç–∞ –¢–†–Ø–ë–í–ê –¥–∞ —Å–∞ 192.168.10
- 255 ‚Üí –ü–æ—Å–ª–µ–¥–Ω–∏—è—Ç –æ–∫—Ç–µ—Ç –ú–û–ñ–ï –î–ê –ï –í–°–ò–ß–ö–û (0-255)

–°—ä–≤–ø–∞–¥–∞ —Å:
‚úÖ 192.168.10.1, 192.168.10.50, 192.168.10.255
‚ùå 192.168.11.1 (—Ä–∞–∑–ª–∏—á–µ–Ω 3-—Ç–∏ –æ–∫—Ç–µ—Ç)
```

**–í ACL:**
```cisco
access-list 10 permit 192.168.10.0 0.0.0.255
```

---

### –ü—Ä–∏–º–µ—Ä 2: –ï–¥–∏–Ω –∫–æ–Ω–∫—Ä–µ—Ç–µ–Ω —Ö–æ—Å—Ç

**–ò—Å–∫–∞–º–µ:** –°–ê–ú–û 192.168.10.50

```
IP:       192.168.10.50
Wildcard: 0.0.0.0

–û–±—è—Å–Ω–µ–Ω–∏–µ:
- –í—Å–∏—á–∫–∏ 4 –æ–∫—Ç–µ—Ç–∞ –¢–†–Ø–ë–í–ê –¥–∞ —Å—ä–≤–ø–∞–¥–∞—Ç –¢–û–ß–ù–û
- –ù–∏—â–æ –Ω–µ —Å–µ –∏–≥–Ω–æ—Ä–∏—Ä–∞

–°—ä–≤–ø–∞–¥–∞ —Å:
‚úÖ 192.168.10.50
‚ùå 192.168.10.51, 192.168.10.49
```

**–í ACL:**
```cisco
access-list 10 permit host 192.168.10.50
! –∏–ª–∏
access-list 10 permit 192.168.10.50 0.0.0.0
```

---

### –ü—Ä–∏–º–µ—Ä 3: –í—Å–∏—á–∫–∏ –∞–¥—Ä–µ—Å–∏ (any)

**–ò—Å–∫–∞–º–µ:** –ê–±—Å–æ–ª—é—Ç–Ω–æ –í–°–ò–ß–ö–ò IP –∞–¥—Ä–µ—Å–∏

```
IP:       0.0.0.0
Wildcard: 255.255.255.255

–û–±—è—Å–Ω–µ–Ω–∏–µ:
- –í—Å–∏—á–∫–∏ –±–∏—Ç–æ–≤–µ —Å–µ –∏–≥–Ω–æ—Ä–∏—Ä–∞—Ç
- –°—ä–≤–ø–∞–¥–∞ —Å –í–°–ò–ß–ö–û
```

**–í ACL:**
```cisco
access-list 10 permit any
! –∏–ª–∏
access-list 10 permit 0.0.0.0 255.255.255.255
```

---

### –ß–µ—Å—Ç–æ —Å—Ä–µ—â–∞–Ω–∏ Wildcard Masks:

| Subnet Mask | Wildcard Mask | –ö–∞–∫–≤–æ –æ–∑–Ω–∞—á–∞–≤–∞ | –ü—Ä–∏–º–µ—Ä |
|-------------|---------------|----------------|---------|
| 255.255.255.255 | 0.0.0.0 | –ï–¥–∏–Ω —Ö–æ—Å—Ç | `host 192.168.10.50` |
| 255.255.255.0 | 0.0.0.255 | /24 –º—Ä–µ–∂–∞ (254 —Ö–æ—Å—Ç–∞) | `192.168.10.0 0.0.0.255` |
| 255.255.0.0 | 0.0.255.255 | /16 –º—Ä–µ–∂–∞ | `192.168.0.0 0.0.255.255` |
| 0.0.0.0 | 255.255.255.255 | –í—Å–∏—á–∫–∏ –∞–¥—Ä–µ—Å–∏ | `any` |

---

## ACL PROCESSING - –ö–ê–ö –†–ê–ë–û–¢–ò?

### –¢—Ä–∏ –∫–ª—é—á–æ–≤–∏ –ø—Ä–∞–≤–∏–ª–∞:

#### 1. **Top-to-Bottom Processing (–ü–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª–Ω–∞ –ø—Ä–æ–≤–µ—Ä–∫–∞)**

```
ACL –ø—Ä–∞–≤–∏–ª–∞—Ç–∞ —Å–µ –ø—Ä–æ–≤–µ—Ä—è–≤–∞—Ç –û–¢ –ì–û–†–ï –ù–ê–î–û–õ–£:

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ 1. permit tcp host 192.168.10.11   ‚îÇ ‚Üê –ü—ä—Ä–≤–æ –ø—Ä–æ–≤–µ—Ä—è–≤–∞ —Ç–æ–≤–∞
‚îÇ         any eq 80                  ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ 2. deny tcp 192.168.10.0 0.0.0.255 ‚îÇ ‚Üê –ü–æ—Å–ª–µ —Ç–æ–≤–∞
‚îÇ         any                        ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ 3. permit ip any any               ‚îÇ ‚Üê –ù–∞–∫—Ä–∞—è —Ç–æ–≤–∞
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ [implicit deny ip any any]         ‚îÇ ‚Üê –ù–µ–≤–∏–¥–∏–º–æ, –≤–∏–Ω–∞–≥–∏ –≤ –∫—Ä–∞—è
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò
```

#### 2. **First Match Wins (–ü—ä—Ä–≤–æ—Ç–æ —Å—ä–≤–ø–∞–¥–µ–Ω–∏–µ –ø–µ—á–µ–ª–∏)**

```
–ö–æ–≥–∞—Ç–æ –ø–∞–∫–µ—Ç –°–™–í–ü–ê–î–ù–ï —Å –ø—Ä–∞–≤–∏–ª–æ ‚Üí –ø—Ä–∏–ª–∞–≥–∞ —Å–µ –∏ –ø—Ä–æ–≤–µ—Ä–∫–∞—Ç–∞ –°–ü–ò–†–ê

–ü—Ä–∏–º–µ—Ä:
–ü–∞–∫–µ—Ç –æ—Ç 192.168.10.11 ‚Üí –ø–æ—Ä—Ç 80
‚îÇ
‚îú‚îÄ –ü—Ä–∞–≤–∏–ª–æ 1: permit tcp host 192.168.10.11 eq 80 ‚Üí ‚úÖ –°–™–í–ü–ê–î–ê!
‚îÇ  ‚îî‚îÄ –†–µ–∑—É–ª—Ç–∞—Ç: PERMIT ‚Üí –°–ü–ò–†–ê —Ç—É–∫ (–Ω–µ –ø—Ä–æ–≤–µ—Ä—è–≤–∞ –æ—Å—Ç–∞–Ω–∞–ª–∏—Ç–µ)
‚îÇ
–ü—Ä–∞–≤–∏–ª–æ 2: deny tcp 192.168.10.0 0.0.0.255 any
‚îî‚îÄ –ù–ï –°–ï –ü–†–û–í–ï–†–Ø–í–ê (–≤–µ—á–µ –µ –º–∏–Ω–∞–ª)
```

#### 3. **Implicit Deny All (–ù–µ–≤–∏–¥–∏–º–æ "deny all" –≤ –∫—Ä–∞—è)**

**–í –∫—Ä–∞—è –Ω–∞ –í–°–ï–ö–ò ACL –∏–º–∞ –Ω–µ–≤–∏–¥–∏–º–æ:**
```cisco
deny ip any any
```

**–ö–æ–µ—Ç–æ –æ–∑–Ω–∞—á–∞–≤–∞:**
```
–ê–∫–æ –ù–ò–¢–û –ï–î–ù–û –ø—Ä–∞–≤–∏–ª–æ –Ω–µ —Å—ä–≤–ø–∞–¥–Ω–µ ‚Üí –∞–≤—Ç–æ–º–∞—Ç–∏—á–Ω–æ DENY ‚ùå
```

**–ó–∞—Ç–æ–≤–∞ –í–ò–ù–ê–ì–ò —Ç—Ä—è–±–≤–∞:**
```cisco
access-list 10 deny host 192.168.10.11
access-list 10 permit any    ‚Üê –ë–ï–ó –¢–û–í–ê: –≤—Å–∏—á–∫–∏ –æ—Å—Ç–∞–Ω–∞–ª–∏ —â–µ –±—ä–¥–∞—Ç –±–ª–æ–∫–∏—Ä–∞–Ω–∏!
```

---

## –ß–ê–°–¢ 1: –¢–æ–ø–æ–ª–æ–≥–∏—è - –ü—Ä–æ–¥—ä–ª–∂–∞–≤–∞–º–µ –æ—Ç Lab 4

### –ò–∑–ø–æ–ª–∑–≤–∞–º–µ —Ç–æ–ø–æ–ª–æ–≥–∏—è—Ç–∞ –æ—Ç Lab 1-4:

```
              [Router R1]
              192.168.10.1 (VLAN 10)
              192.168.20.1 (VLAN 20)
                   |
            GigE0/0 (trunk)
                   |
              [Switch SW1]
         /     |     |     |     \
     Fa0/11 Fa0/2 Fa0/3 Fa0/4 Fa0/5
        |     |     |     |     |
      DNS   PC1   PC2   PC3   PC4
     Server Admin Admin  IT    IT
   .10.2  .10.11 .10.12 .20.11 .20.12
   
   VLAN 10 (Admin)       VLAN 20 (IT)
```

### –ú—Ä–µ–∂–æ–≤–∞ –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –æ—Ç –ø—Ä–µ–¥–∏—à–Ω–∏—Ç–µ –ª–∞–±–æ–≤–µ:

| VLAN | –ò–º–µ | Network | Gateway | DNS Server |
|------|-----|---------|---------|------------|
| 10 | Administration | 192.168.10.0/24 | 192.168.10.1 | 192.168.10.2 |
| 20 | IT Department | 192.168.20.0/24 | 192.168.20.1 | 192.168.10.2 |

### –£—Å—Ç—Ä–æ–π—Å—Ç–≤–∞:
- **DNS Server:** 192.168.10.2 (–Ω–∞ Fa0/11, VLAN 10)
- **PC1:** 192.168.10.11 (VLAN 10 - Admin)
- **PC2:** 192.168.10.12 (VLAN 10 - Admin)
- **PC3:** 192.168.20.11 (VLAN 20 - IT)
- **PC4:** 192.168.20.12 (VLAN 20 - IT)

**–ó–∞–±–µ–ª–µ–∂–∫–∞:** –ê–∫–æ –≤–∞—à–∞—Ç–∞ —Ç–æ–ø–æ–ª–æ–≥–∏—è –æ—Ç Lab 4 –∏–º–∞ —Ä–∞–∑–ª–∏—á–Ω–∏ IP –∞–¥—Ä–µ—Å–∏, –∏–∑–ø–æ–ª–∑–≤–∞–π—Ç–µ –≥–∏ –≤ –ø—Ä–∏–º–µ—Ä–∏—Ç–µ –ø–æ-–¥–æ–ª—É.

---

## –ß–ê–°–¢ 2: –¢–µ—Å—Ç–≤–∞–Ω–µ –ë–ï–ó ACL (baseline test) (10 –º–∏–Ω)

### –ü—Ä–µ–¥–∏ –¥–∞ –¥–æ–±–∞–≤—è–º–µ ACL, —Ç–µ—Å—Ç–≤–∞–º–µ –∫–∞–∫–≤–æ —Ä–∞–±–æ—Ç–∏:

**–û—Ç PC3 (IT VLAN 20):**
```
ping 192.168.10.2     (DNS Server –≤ Admin VLAN)
ping 192.168.10.11    (PC1 –≤ Admin VLAN)
ping 192.168.10.12    (PC2 –≤ Admin VLAN)
```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:**
```
‚úÖ –í—Å–∏—á–∫–∏ ping-–æ–≤–µ —Ä–∞–±–æ—Ç—è—Ç (–±–µ–∑ ACL, –Ω—è–º–∞ —Ä–µ—Å—Ç—Ä–∏–∫—Ü–∏–∏)
```

**–û—Ç PC1 (Admin VLAN 10):**
```
ping 192.168.20.11    (PC3 –≤ IT VLAN)
ping 192.168.20.12    (PC4 –≤ IT VLAN)
```

**–û—á–∞–∫–≤–∞–Ω —Ä–µ–∑—É–ª—Ç–∞—Ç:**
```
‚úÖ –í—Å–∏—á–∫–∏ ping-–æ–≤–µ —Ä–∞–±–æ—Ç—è—Ç
```

**–î–æ–∫—É–º–µ–Ω—Ç–∏—Ä–∞–π—Ç–µ —Ä–µ–∑—É–ª—Ç–∞—Ç–∏—Ç–µ:** –©–µ –≥–∏ —Å—Ä–∞–≤–Ω–∏–º —Å–ª–µ–¥ –ø—Ä–∏–ª–∞–≥–∞–Ω–µ –Ω–∞ ACL!

---

## –ß–ê–°–¢ 3: –°—Ü–µ–Ω–∞—Ä–∏–π 1 - –ë–ª–æ–∫–∏—Ä–∞–Ω–µ –Ω–∞ –∫–æ–Ω–∫—Ä–µ—Ç–µ–Ω —Ö–æ—Å—Ç (20 –º–∏–Ω)

### –ò–∑–∏—Å–∫–≤–∞–Ω–µ:
**–ë–ª–æ–∫–∏—Ä–∞–π PC2 (192.168.10.12) –¥–∞ –¥–æ—Å—Ç—ä–ø–≤–∞ DNS —Å—ä—Ä–≤—ä—Ä–∞ (192.168.10.2)**

### –°—Ç—ä–ø–∫–∞ 1: –°—ä–∑–¥–∞–≤–∞–Ω–µ –Ω–∞ Standard ACL

```cisco
R1# configure terminal
R1(config)# access-list 10 remark Block PC2 to DNS Server
R1(config)# access-list 10 deny host 192.168.10.12
R1(config)# access-list 10 permit any
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ:**
- `remark` - –∫–æ–º–µ–Ω—Ç–∞—Ä (–¥–æ–∫—É–º–µ–Ω—Ç–∞—Ü–∏—è)
- `deny host 192.168.10.12` - –±–ª–æ–∫–∏—Ä–∞ –°–ê–ú–û PC2
- `permit any` - **–ö–†–ò–¢–ò–ß–ù–û!** –ü–æ–∑–≤–æ–ª—è–≤–∞ –≤—Å–∏—á–∫–∏ –æ—Å—Ç–∞–Ω–∞–ª–∏ (–±–µ–∑ —Ç–æ–≤–∞ implicit deny —â–µ –±–ª–æ–∫–∏—Ä–∞ –≤—Å–∏—á–∫–∏)

### –°—Ç—ä–ø–∫–∞ 2: –ü—Ä–∏–ª–∞–≥–∞–Ω–µ –Ω–∞ ACL

**Standard ACL –ø—Ä–∏–ª–∞–≥–∞–º–µ –±–ª–∏–∑–æ –¥–æ DESTINATION (DNS —Å—ä—Ä–≤—ä—Ä–∞):**

```cisco
R1(config)# interface GigabitEthernet0/0.10
R1(config-subif)# ip access-group 10 out
R1(config-subif)# exit
```

**–ó–∞—â–æ –Ω–∞ .10 subinterface?**
- DNS —Å—ä—Ä–≤—ä—Ä—ä—Ç –µ –≤—ä–≤ VLAN 10
- `out` = —Ç—Ä–∞—Ñ–∏–∫ –ò–ó–õ–ò–ó–ê–© –∫—ä–º VLAN 10

### –°—Ç—ä–ø–∫–∞ 3: –ó–∞–ø–∏—Å–≤–∞–Ω–µ
```cisco
R1(config)# exit
R1# copy running-config startup-config
```

### –°—Ç—ä–ø–∫–∞ 4: –¢–µ—Å—Ç–≤–∞–Ω–µ

**–û—Ç PC2 (192.168.10.12):**
```
ping 192.168.10.2    ‚Üê –¢—Ä—è–±–≤–∞ –¥–∞ FAIL ‚ùå
```

**–û—Ç PC1 (192.168.10.11):**
```
ping 192.168.10.2    ‚Üê –¢—Ä—è–±–≤–∞ –¥–∞ —Ä–∞–±–æ—Ç–∏ ‚úÖ
```

**–û—Ç PC3 (192.168.20.11):**
```
ping 192.168.10.2    ‚Üê –¢—Ä—è–±–≤–∞ –¥–∞ —Ä–∞–±–æ—Ç–∏ ‚úÖ
```

### –í–µ—Ä–∏—Ñ–∏–∫–∞—Ü–∏—è:
```cisco
R1# show access-lists
Standard IP access list 10
    10 deny   192.168.10.12
    20 permit any (5 matches)

R1# show ip interface GigabitEthernet0/0.10 | include access list
  Outgoing access list is 10
```

---

## –ß–ê–°–¢ 4: Extended ACL - –†–∞–∑—Ä–µ—à–∞–≤–∞–Ω–µ —Å–∞–º–æ HTTP/HTTPS (30 –º–∏–Ω)

### –ò–∑–∏—Å–∫–≤–∞–Ω–µ:
**IT VLAN –º–æ–∂–µ –¥–∞ –¥–æ—Å—Ç—ä–ø–≤–∞ —Å–∞–º–æ HTTP (80) –∏ HTTPS (443) –∫—ä–º Admin VLAN, –Ω–æ –Ω–µ –∏ –¥—Ä—É–≥–∏ —É—Å–ª—É–≥–∏**

### –°—Ç—ä–ø–∫–∞ 1: –ü—Ä–µ–º–∞—Ö–≤–∞–Ω–µ –Ω–∞ –ø—Ä–µ–¥–∏—à–Ω–∏—è ACL

```cisco
R1# configure terminal
R1(config)# interface GigabitEthernet0/0.10
R1(config-subif)# no ip access-group 10 out
R1(config-subif)# exit
R1(config)# no access-list 10
```

### –°—Ç—ä–ø–∫–∞ 2: –°—ä–∑–¥–∞–≤–∞–Ω–µ –Ω–∞ Extended ACL

```cisco
R1(config)# access-list 100 remark IT to Admin - HTTP/HTTPS only
R1(config)# access-list 100 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 80
R1(config)# access-list 100 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 443
R1(config)# access-list 100 permit icmp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
R1(config)# access-list 100 deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
R1(config)# access-list 100 permit ip any any
```

**–û–±—è—Å–Ω–µ–Ω–∏–µ –Ω–∞ wildcard mask:**
- 0.0.0.255 –æ–∑–Ω–∞—á–∞–≤–∞ "–∏–≥–Ω–æ—Ä–∏—Ä–∞–π –ø–æ—Å–ª–µ–¥–Ω–∏—è –æ–∫—Ç–µ—Ç"
- 192.168.20.0 0.0.0.255 = –≤—Å–∏—á–∫–∏ –∞–¥—Ä–µ—Å–∏ –æ—Ç 192.168.20.0 –¥–æ .255

**–õ–æ–≥–∏–∫–∞ –Ω–∞ ACL 100:**
1. Permit TCP port 80 (HTTP) –æ—Ç IT –∫—ä–º Admin
2. Permit TCP port 443 (HTTPS) –æ—Ç IT –∫—ä–º Admin
3. Permit ICMP (ping) –æ—Ç IT –∫—ä–º Admin - –∑–∞ —Ç–µ—Å—Ç–≤–∞–Ω–µ
4. Deny –≤—Å–∏—á–∫–æ –æ—Å—Ç–∞–Ω–∞–ª–æ –æ—Ç IT –∫—ä–º Admin
5. Permit –≤—Å–∏—á–∫–æ –æ—Å—Ç–∞–Ω–∞–ª–æ (–¥—Ä—É–≥–∏ VLAN-–∏ –∏–ª–∏ —Ç—Ä–∞—Ñ–∏–∫)

### –°—Ç—ä–ø–∫–∞ 3: –ü—Ä–∏–ª–∞–≥–∞–Ω–µ –Ω–∞ ACL

**Extended ACL –ø—Ä–∏–ª–∞–≥–∞–º–µ –±–ª–∏–∑–æ –¥–æ SOURCE:**

```cisco
R1(config)# interface GigabitEthernet0/0.20
R1(config-subif)# ip access-group 100 in
R1(config-subif)# exit
R1(config)# exit
R1# copy running-config startup-config
```

**–ó–∞—â–æ `in`?**
- –°–ø–∏—Ä–∞ —Ç—Ä–∞—Ñ–∏–∫–∞ –ö–û–ì–ê–¢–û –í–õ–ò–ó–ê –æ—Ç VLAN 20 –∫—ä–º router-–∞
- –ü–æ-–µ—Ñ–µ–∫—Ç–∏–≤–Ω–æ (—Å–ø–∏—Ä–∞–º–µ –≥–æ —Ä–∞–Ω–æ)

### –°—Ç—ä–ø–∫–∞ 4: –¢–µ—Å—Ç–≤–∞–Ω–µ

**–û—Ç PC3 (IT VLAN - 192.168.20.11):**
```
ping 192.168.10.2      ‚Üê DNS Server ‚Üí ‚úÖ –†–ê–ë–û–¢–ò (ICMP permitnat)
ping 192.168.10.11     ‚Üê PC1 ‚Üí ‚úÖ –†–ê–ë–û–¢–ò
```

**–°–∏–º—É–ª–∏—Ä–∞–Ω–µ –Ω–∞ HTTP —Ç—Ä–∞—Ñ–∏–∫ (Packet Tracer):**
- Desktop ‚Üí Web Browser ‚Üí http://192.168.10.2
- –ê–∫–æ –∏–º–∞ HTTP server –Ω–∞ DNS-–∞ ‚Üí ‚úÖ –†–ê–ë–û–¢–ò

**–¢–µ—Å—Ç–≤–∞–Ω–µ –Ω–∞ –±–ª–æ–∫–∏—Ä–∞–Ω–∏ —É—Å–ª—É–≥–∏:**
```
telnet 192.168.10.2 23  ‚Üê Telnet ‚Üí ‚ùå –ù–ï –†–ê–ë–û–¢–ò (–±–ª–æ–∫–∏—Ä–∞–Ω)
```

**–û—Ç PC1 (Admin VLAN ‚Üí 192.168.10.11):**
```
ping 192.168.20.11   ‚Üê PC3 –≤ IT ‚Üí ‚úÖ –†–ê–ë–û–¢–ò (–Ω—è–º–∞ —Ä–µ—Å—Ç—Ä–∏–∫—Ü–∏–∏ –æ—Ç Admin –∫—ä–º IT)
```

### –í–µ—Ä–∏—Ñ–∏–∫–∞—Ü–∏—è:

```cisco
R1# show access-lists 100
Extended IP access list 100
    10 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq www
    20 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 443
    30 permit icmp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 (3 matches)
    40 deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
    50 permit ip any any (15 matches)

R1# show ip interface GigabitEthernet0/0.20
GigabitEthernet0/0.20 is up, line protocol is up
  Internet address is 192.168.20.1/24
  Inbound  access list is 100
  Outgoing access list is not set
```

**–ó–∞–±–µ–ª–µ–∂–∫–∞:** `(X matches)` –ø–æ–∫–∞–∑–≤–∞ –∫–æ–ª–∫–æ –ø—ä—Ç–∏ –µ –∏–∑–ø–æ–ª–∑–≤–∞–Ω–æ –ø—Ä–∞–≤–∏–ª–æ—Ç–æ

---

## –ß–ê–°–¢ 5: Named ACL - –ú–æ–¥–µ—Ä–µ–Ω –ø–æ–¥—Ö–æ–¥ (20 –º–∏–Ω)

### –ü—Ä–µ–¥–∏–º—Å—Ç–≤–∞ –Ω–∞ Named ACL:
- –ü–æ-—á–µ—Ç–ª–∏–≤–∏ –∏–º–µ–Ω–∞ (–≤–º–µ—Å—Ç–æ –Ω–æ–º–µ—Ä–∞)
- –õ–µ—Å–Ω–æ —Å–µ —Ä–µ–¥–∞–∫—Ç–∏—Ä–∞—Ç (add/remove/resequence rules)
- –ü–æ-–¥–æ–±—Ä–∞ –æ—Ä–≥–∞–Ω–∏–∑–∞—Ü–∏—è –∏ –¥–æ–∫—É–º–µ–Ω—Ç–∞—Ü–∏—è

### –°—Ü–µ–Ω–∞—Ä–∏–π: –°—ä–∑–¥–∞–≤–∞–Ω–µ –Ω–∞ Named Extended ACL

### –°—Ç—ä–ø–∫–∞ 1: –ü—Ä–µ–º–∞—Ö–≤–∞–Ω–µ –Ω–∞ –Ω–æ–º–µ—Ä–∏—Ä–∞–Ω–∏—è ACL

```cisco
R1# configure terminal
R1(config)# interface GigabitEthernet0/0.20
R1(config-subif)# no ip access-group 100 in
R1(config-subif)# exit
R1(config)# no access-list 100
```

### –°—Ç—ä–ø–∫–∞ 2: –°—ä–∑–¥–∞–≤–∞–Ω–µ –Ω–∞ Named ACL

```cisco
R1(config)# ip access-list extended IT_TO_ADMIN
R1(config-ext-nacl)# remark Allow only HTTP and HTTPS from IT to Admin
R1(config-ext-nacl)# permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 80
R1(config-ext-nacl)# permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 443
R1(config-ext-nacl)# permit icmp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
R1(config-ext-nacl)# deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
R1(config-ext-nacl)# permit ip any any
R1(config-ext-nacl)# exit
```

### –°—Ç—ä–ø–∫–∞ 3: –ü—Ä–∏–ª–∞–≥–∞–Ω–µ

```cisco
R1(config)# interface GigabitEthernet0/0.20
R1(config-subif)# ip access-group IT_TO_ADMIN in
R1(config-subif)# exit
R1(config)# exit
R1# copy running-config startup-config
```

### –°—Ç—ä–ø–∫–∞ 4: –î–æ–±–∞–≤—è–Ω–µ/–†–µ–¥–∞–∫—Ç–∏—Ä–∞–Ω–µ –Ω–∞ –ø—Ä–∞–≤–∏–ª–∞

**–ü—Ä–µ–¥–∏–º—Å—Ç–≤–æ:** –ú–æ–∂–µ–º –¥–∞ –≤–º—ä–∫–Ω–µ–º –Ω–æ–≤–æ –ø—Ä–∞–≤–∏–ª–æ –Ω–∞ –∫–æ–Ω–∫—Ä–µ—Ç–Ω–∞ –ø–æ–∑–∏—Ü–∏—è!

```cisco
R1(config)# ip access-list extended IT_TO_ADMIN
R1(config-ext-nacl)# 15 permit tcp host 192.168.20.11 any eq 22
R1(config-ext-nacl)# exit
```

**–ù–æ–º–µ—Ä—ä—Ç 15** –ø–æ—Å—Ç–∞–≤—è –ø—Ä–∞–≤–∏–ª–æ—Ç–æ –ü–†–ï–î–ò –ø—Ä–∞–≤–∏–ª–æ 20.

### –ü–æ–∫–∞–∑–≤–∞–Ω–µ –Ω–∞ –ø—Ä–∞–≤–∏–ª–∞—Ç–∞ —Å –Ω–æ–º–µ—Ä–∞:

```cisco
R1# show access-lists IT_TO_ADMIN
Extended IP access list IT_TO_ADMIN
    10 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq www
    15 permit tcp host 192.168.20.11 any eq 22
    20 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 443
    30 permit icmp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
    40 deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
    50 permit ip any any
```

### –ò–∑—Ç—Ä–∏–≤–∞–Ω–µ –Ω–∞ –∫–æ–Ω–∫—Ä–µ—Ç–Ω–æ –ø—Ä–∞–≤–∏–ª–æ:

```cisco
R1(config)# ip access-list extended IT_TO_ADMIN
R1(config-ext-nacl)# no 15
R1(config-ext-nacl)# exit
```

---

## –ß–ê–°–¢ 6: SSH Access Control –Ω–∞ Router (15 –º–∏–Ω)

### –ò–∑–∏—Å–∫–≤–∞–Ω–µ:
**–°–∞–º–æ Admin VLAN (192.168.10.0/24) –º–æ–∂–µ –¥–∞ –ø—Ä–∞–≤–∏ SSH –∫—ä–º router-–∞**

‚ö†Ô∏è **–í–ù–ò–ú–ê–ù–ò–ï:** –ü—Ä–µ–¥–∏ –¥–∞ –ø—Ä–∏–ª–∞–≥–∞—Ç–µ ACL –Ω–∞ VTY –ª–∏–Ω–∏–∏—Ç–µ, —É–≤–µ—Ä–µ—Ç–µ —Å–µ —á–µ:
1. –ö–æ–Ω–∑–æ–ª–Ω–∏—è—Ç –¥–æ—Å—Ç—ä–ø —Ä–∞–±–æ—Ç–∏ (–∑–∞ rescue –ø—Ä–∏ –≥—Ä–µ—à–∫–∞)
2. ACL –≤–∫–ª—é—á–≤–∞ –í–ê–®–ò–Ø —Ç–µ–∫—É—â IP –∞–¥—Ä–µ—Å
3. –ò–º–∞—Ç–µ —Ñ–∏–∑–∏—á–µ—Å–∫–∏ –¥–æ—Å—Ç—ä–ø –¥–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–æ—Ç–æ –ø—Ä–∏ –Ω—É–∂–¥–∞

**–ì—Ä–µ—à–∫–∞ –≤ ACL –º–æ–∂–µ –¥–∞ –≤–∏ –±–ª–æ–∫–∏—Ä–∞ –Ω–∞–ø—ä–ª–Ω–æ –æ—Ç –¥–æ—Å—Ç—ä–ø!**

### –°—Ç—ä–ø–∫–∞ 1: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–Ω–µ –Ω–∞ SSH –Ω–∞ router (–∞–∫–æ –Ω–µ –µ –Ω–∞–ø—Ä–∞–≤–µ–Ω–æ)

```cisco
R1(config)# hostname R1
R1(config)# ip domain-name company.local
R1(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
R1(config)# username admin secret cisco123
R1(config)# line vty 0 4
R1(config-line)# transport input ssh
R1(config-line)# login local
R1(config-line)# exit
```

### –°—Ç—ä–ø–∫–∞ 2: –°—ä–∑–¥–∞–≤–∞–Ω–µ –Ω–∞ Standard ACL –∑–∞ VTY

```cisco
R1(config)# access-list 50 remark SSH Access from Admin VLAN only
R1(config)# access-list 50 permit 192.168.10.0 0.0.0.255
R1(config)# access-list 50 deny any
```

### –°—Ç—ä–ø–∫–∞ 3: –ü—Ä–∏–ª–∞–≥–∞–Ω–µ –Ω–∞ VTY –ª–∏–Ω–∏–∏—Ç–µ

```cisco
R1(config)# line vty 0 4
R1(config-line)# access-class 50 in
R1(config-line)# exit
R1(config)# exit
R1# copy running-config startup-config
```

**–ó–∞–±–µ–ª–µ–∂–∫–∞:** –ó–∞ VTY –∏–∑–ø–æ–ª–∑–≤–∞–º–µ `access-class` (–Ω–µ `ip access-group`)

### –°—Ç—ä–ø–∫–∞ 4: –¢–µ—Å—Ç–≤–∞–Ω–µ

**–û—Ç PC1 (Admin VLAN - 192.168.10.11):**
```
Desktop ‚Üí Command Prompt:
ssh -l admin 192.168.10.1
Password: cisco123

‚úÖ –¢—Ä—è–±–≤–∞ –¥–∞ —Å–µ —Å–≤—ä—Ä–∂–µ
```

**–ó–∞–±–µ–ª–µ–∂–∫–∞ –∑–∞ Packet Tracer:** –ö–æ–º–∞–Ω–¥–∞—Ç–∞ –µ `ssh -l username IP`, –∑–∞ —Ä–∞–∑–ª–∏–∫–∞ –æ—Ç —Ä–µ–∞–ª–Ω–∞—Ç–∞ —Å—Ä–µ–¥–∞ –∫—ä–¥–µ—Ç–æ –º–æ–∂–µ –∏ `ssh username@IP`

**–û—Ç PC3 (IT VLAN - 192.168.20.11):**
```
ssh -l admin 192.168.10.1

‚ùå Connection refused –∏–ª–∏ timeout
```

### –í–µ—Ä–∏—Ñ–∏–∫–∞—Ü–∏—è:

```cisco
R1# show access-lists 50
Standard IP access list 50
    10 permit 192.168.10.0, wildcard bits 0.0.0.255
    20 deny   any

R1# show line vty 0 4 | include access
Access Class 50
```

---

## –ß–ê–°–¢ 7: Troubleshooting ACL (10 –º–∏–Ω)

### –ß–µ—Å—Ç–æ —Å—Ä–µ—â–∞–Ω–∏ –≥—Ä–µ—à–∫–∏ –∏ —Ä–µ—à–µ–Ω–∏—è:

| –ì—Ä–µ—à–∫–∞ | –°–∏–º–ø—Ç–æ–º | –ö–∞–∫ –¥–∞ –ø—Ä–æ–≤–µ—Ä–∏–º | –†–µ—à–µ–Ω–∏–µ |
|--------|---------|-----------------|---------|
| **–ó–∞–±—Ä–∞–≤–µ–Ω `permit any`** | –í—Å–∏—á–∫–æ –±–ª–æ–∫–∏—Ä–∞–Ω–æ (implicit deny) | `show access-lists` | –î–æ–±–∞–≤–∏ `access-list X permit any` |
| **–ì—Ä–µ—à–Ω–∞ –ø–æ—Å–æ–∫–∞ (IN/OUT)** | ACL –Ω–µ —Ä–∞–±–æ—Ç–∏ | `show ip interface GigE0/0.X` | –ü—Ä–æ–º–µ–Ω–∏ –Ω–∞ –ø—Ä–∞–≤–∏–ª–Ω–∞—Ç–∞ –ø–æ—Å–æ–∫–∞ |
| **Subnet mask –≤–º–µ—Å—Ç–æ wildcard** | –§–∏–ª—Ç—Ä–∏—Ä–∞ –≥—Ä–µ—à–Ω–æ | –ü—Ä–æ–≤–µ—Ä–∫–∞ –Ω–∞ –∫–æ–º–∞–Ω–¥–∞—Ç–∞ | –ò–∑–ø–æ–ª–∑–≤–∞–π `255.255.255.255 - subnet` |
| **ACL –Ω–∞ —Ñ–∏–∑–∏—á–µ—Å–∫–∏ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å** | –ù–µ —Ä–∞–±–æ—Ç–∏ –∑–∞ Router-on-a-Stick | `show ip interface GigE0/0` | –ü—Ä–∏–ª–æ–∂–∏ –Ω–∞ subinterface (.10, .20) |
| **–ì—Ä–µ—à–µ–Ω —Ä–µ–¥ –Ω–∞ –ø—Ä–∞–≤–∏–ª–∞—Ç–∞** | –ü—ä—Ä–≤–æ—Ç–æ –ø—Ä–∞–≤–∏–ª–æ –±–ª–æ–∫–∏—Ä–∞ –≤—Å–∏—á–∫–æ | `show access-lists` | –ü—Ä–µ–Ω–∞—Ä–µ–¥–∏ —Å Named ACL |

---

### –ü–æ–ª–µ–∑–Ω–∏ –∫–æ–º–∞–Ω–¥–∏ –∑–∞ troubleshooting:

```cisco
! –ü—Ä–µ–≥–ª–µ–¥ –Ω–∞ –≤—Å–∏—á–∫–∏ ACL-–∏
show access-lists

! –ü—Ä–µ–≥–ª–µ–¥ –Ω–∞ –∫–æ–Ω–∫—Ä–µ—Ç–µ–Ω ACL
show access-lists 100
show access-lists IT_TO_ADMIN

! –ö—ä–¥–µ –µ –ø—Ä–∏–ª–æ–∂–µ–Ω ACL-–∞
show ip interface GigabitEthernet0/0.20

! –°—Ç–∞—Ç–∏—Å—Ç–∏–∫–∞ (matches)
show access-lists
! –ì–ª–µ–¥–∞–π "(X matches)" - –ø–æ–∫–∞–∑–≤–∞ –∫–æ–ª–∫–æ –ø—ä—Ç–∏ –µ –∏–∑–ø–æ–ª–∑–≤–∞–Ω–æ –ø—Ä–∞–≤–∏–ª–æ—Ç–æ

! –ù—É–ª–∏—Ä–∞–Ω–µ –Ω–∞ counters
clear ip access-list counters
```

---

### Debug –∫–æ–º–∞–Ω–¥–∏ (–í–ù–ò–ú–ê–í–ê–ô–¢–ï - –≥–µ–Ω–µ—Ä–∏—Ä–∞—Ç –º–Ω–æ–≥–æ output!):

```cisco
! –í–∫–ª—é—á–≤–∞–Ω–µ
R1# debug ip packet
R1# debug ip access-list

! –ù–∞–ø—Ä–∞–≤–µ—Ç–µ —Ç–µ—Å—Ç–∞ (ping, etc.)

! –í–ê–ñ–ù–û: –ò–∑–∫–ª—é—á–µ—Ç–µ —Å–ª–µ–¥ —Ç–æ–≤–∞!
R1# undebug all
```

---

## –ß–ï–°–¢–û –°–†–ï–©–ê–ù–ò –ü–†–û–ë–õ–ï–ú–ò –ò –†–ï–®–ï–ù–ò–Ø

### üî¥ –ü—Ä–æ–±–ª–µ–º 1: ACL –Ω–µ –±–ª–æ–∫–∏—Ä–∞ —Ç—Ä–∞—Ñ–∏–∫–∞

**–°–∏–º–ø—Ç–æ–º–∏:** Ping-–æ–≤–µ—Ç–µ –º–∏–Ω–∞–≤–∞—Ç, –≤—ä–ø—Ä–µ–∫–∏ —á–µ —Ç—Ä—è–±–≤–∞ –¥–∞ —Å–∞ –±–ª–æ–∫–∏—Ä–∞–Ω–∏

**–ü—Ä–æ–≤–µ—Ä–∫–∏:**
```cisco
! 1. ACL —Å—ä–∑–¥–∞–¥–µ–Ω –ª–∏ –µ?
show access-lists

! 2. ACL –ø—Ä–∏–ª–æ–∂–µ–Ω –ª–∏ –µ –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞?
show ip interface GigabitEthernet0/0.20

! 3. –ü—Ä–∞–≤–∏–ª–Ω–∞ –ø–æ—Å–æ–∫–∞ (in/out)?
show run interface GigabitEthernet0/0.20
```

**–í—ä–∑–º–æ–∂–Ω–∏ –ø—Ä–∏—á–∏–Ω–∏:**
- ‚úÖ ACL –Ω–µ –µ –ø—Ä–∏–ª–æ–∂–µ–Ω –∫—ä–º –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞
- ‚úÖ –ì—Ä–µ—à–Ω–∞ –ø–æ—Å–æ–∫–∞ (in –≤–º–µ—Å—Ç–æ out –∏–ª–∏ –æ–±—Ä–∞—Ç–Ω–æ)
- ‚úÖ `permit any` –≤ –∫—Ä–∞—è –ø–æ–∑–≤–æ–ª—è–≤–∞ –≤—Å–∏—á–∫–æ
- ‚úÖ ACL –µ –Ω–∞ —Ñ–∏–∑–∏—á–µ—Å–∫–∏—è –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å –≤–º–µ—Å—Ç–æ –Ω–∞ subinterface

---

### üî¥ –ü—Ä–æ–±–ª–µ–º 2: –í—Å–∏—á–∫–æ –µ –±–ª–æ–∫–∏—Ä–∞–Ω–æ (–¥–æ—Ä–∏ —Ä–∞–∑—Ä–µ—à–µ–Ω–∏—è —Ç—Ä–∞—Ñ–∏–∫)

**–ü—Ä–∏—á–∏–Ω–∞:** Implicit deny all (–∑–∞–±—Ä–∞–≤–µ–Ω–æ `permit any`)

**–†–µ—à–µ–Ω–∏–µ:**
```cisco
R1(config)# access-list 10 permit any
! –∏–ª–∏ –∑–∞ Extended ACL:
R1(config)# access-list 100 permit ip any any
```

**–ö–∞–∫ –¥–∞ –ø—Ä–æ–≤–µ—Ä—è:**
```cisco
R1# show access-lists
! –í–∏–∂ –ø–æ—Å–ª–µ–¥–Ω–æ—Ç–æ –ø—Ä–∞–≤–∏–ª–æ - –∏–º–∞ –ª–∏ "permit any"?
```

---

### üî¥ –ü—Ä–æ–±–ª–µ–º 3: SSH –Ω–µ —Ä–∞–±–æ—Ç–∏ —Å–ª–µ–¥ –ø—Ä–∏–ª–∞–≥–∞–Ω–µ –Ω–∞ ACL 50

**–ü—Ä–∏—á–∏–Ω–∞:** ACL 50 –±–ª–æ–∫–∏—Ä–∞ –¢–í–û–Ø IP –∞–¥—Ä–µ—Å

**–°–∏–º–ø—Ç–æ–º–∏:** 
- SSH connection refused
- –ù–µ –º–æ–∂–µ—à –¥–∞ –≤–ª–µ–∑–µ—à –≤ router-–∞

**–°–ü–ï–®–ù–û —Ä–µ—à–µ–Ω–∏–µ:**
```cisco
! –í–ª–µ–∑ –ø—Ä–µ–∑ CONSOLE –∫–∞–±–µ–ª (—Ñ–∏–∑–∏—á–µ—Å–∫–∏ –¥–æ—Å—Ç—ä–ø)
Router> enable
Router# configure terminal
Router(config)# line vty 0 4
Router(config-line)# no access-class 50 in
Router(config-line)# exit
Router(config)# access-list 50 permit 192.168.10.0 0.0.0.255
Router(config)# line vty 0 4
Router(config-line)# access-class 50 in
```

**–ü—Ä–µ–≤–µ–Ω—Ü–∏—è:** –í–ò–ù–ê–ì–ò —Ç–µ—Å—Ç–≤–∞–π ACL –ø—Ä–µ–¥–∏ –¥–∞ –≥–æ –ø—Ä–∏–ª–∞–≥–∞—à –Ω–∞ VTY!

---

### üü° –ü—Ä–æ–±–ª–µ–º 4: ACL –ø—Ä–∞–≤–∏–ª–∞—Ç–∞ —Å–∞ –≤ –≥—Ä–µ—à–µ–Ω —Ä–µ–¥

**–ü—Ä–∏—á–∏–Ω–∞:** First match wins - –ø—ä—Ä–≤–æ—Ç–æ –ø—Ä–∞–≤–∏–ª–æ –±–ª–æ–∫–∏—Ä–∞ –≤—Å–∏—á–∫–æ

**–ü—Ä–∏–º–µ—Ä –Ω–∞ –≥—Ä–µ—à–∫–∞:**
```cisco
access-list 100 deny ip 192.168.20.0 0.0.0.255 any     ‚Üê –ë–ª–æ–∫–∏—Ä–∞ –í–°–ò–ß–ö–û
access-list 100 permit tcp 192.168.20.0 0.0.0.255 any eq 80  ‚Üê –ù–∏–∫–æ–≥–∞ –Ω–µ —Å–µ –¥–æ—Å—Ç–∏–≥–∞
```

**–†–µ—à–µ–Ω–∏–µ:** –ò–∑–ø–æ–ª–∑–≤–∞–π Named ACL –∑–∞ –ø—Ä–µ–Ω–∞—Ä–µ–∂–¥–∞–Ω–µ
```cisco
R1(config)# ip access-list extended MY_ACL
R1(config-ext-nacl)# no 10   ‚Üê –ò–∑—Ç—Ä–∏–π –≥—Ä–µ—à–Ω–æ—Ç–æ –ø—Ä–∞–≤–∏–ª–æ
R1(config-ext-nacl)# 5 permit tcp 192.168.20.0 0.0.0.255 any eq 80  ‚Üê –ü–æ—Å—Ç–∞–≤–∏ –≥–æ –ü–†–ï–î–ò deny
```

---

### üü° –ü—Ä–æ–±–ª–µ–º 5: Wildcard mask –≥—Ä–µ—à–∫–∞

**–°–∏–º–ø—Ç–æ–º:** ACL —Ñ–∏–ª—Ç—Ä–∏—Ä–∞ –ø–æ–≤–µ—á–µ/–ø–æ-–º–∞–ª–∫–æ –æ—Ç–∫–æ–ª–∫–æ—Ç–æ —Ç—Ä—è–±–≤–∞

**–ß–µ—Å—Ç–æ —Å—Ä–µ—â–∞–Ω–∞ –≥—Ä–µ—à–∫–∞:**
```cisco
! –ì–†–ï–®–ù–û (subnet mask –≤–º–µ—Å—Ç–æ wildcard):
access-list 10 permit 192.168.10.0 255.255.255.0  ‚ùå

! –ü–†–ê–í–ò–õ–ù–û (wildcard mask):
access-list 10 permit 192.168.10.0 0.0.0.255  ‚úÖ
```

**–§–æ—Ä–º—É–ª–∞:** Wildcard = 255.255.255.255 - Subnet Mask

---

### üü¢ –ü—Ä–æ–±–ª–µ–º 6: –ù–µ –≤–∏–∂–¥–∞–º "(X matches)" –≤ show access-lists

**–ü—Ä–∏—á–∏–Ω–∞:** –¢—Ä–∞—Ñ–∏–∫ –Ω–µ –ø—Ä–µ–º–∏–Ω–∞–≤–∞ –ø—Ä–µ–∑ ACL –ø—Ä–∞–≤–∏–ª–æ—Ç–æ

**–ü—Ä–æ–≤–µ—Ä–∫–∏:**
1. –ì–µ–Ω–µ—Ä–∏—Ä–∞–π —Ç—Ä–∞—Ñ–∏–∫ (ping, web browser)
2. –ò–∑—á–∞–∫–∞–π 5-10 —Å–µ–∫—É–Ω–¥–∏
3. –ü—Ä–æ–≤–µ—Ä–∏ –æ—Ç–Ω–æ–≤–æ: `show access-lists`

**–ù—É–ª–∏—Ä–∞–Ω–µ –Ω–∞ counters:**
```cisco
R1# clear ip access-list counters
```

---

## CHECKLIST –ü–†–ï–î–ò –ü–†–ò–õ–ê–ì–ê–ù–ï –ù–ê ACL

```
‚òê –ù–∞–ø—Ä–∞–≤–∏–ª —Å—ä–º backup –Ω–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞
‚òê –ò–º–∞–º console –¥–æ—Å—Ç—ä–ø (—Ñ–∏–∑–∏—á–µ—Å–∫–∏ –∫–∞–±–µ–ª)
‚òê –¢–µ—Å—Ç–≤–∞–ª —Å—ä–º ACL –Ω–∞ test –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å –ø—ä—Ä–≤–æ
‚òê ACL –≤–∫–ª—é—á–≤–∞ "permit any" (–∞–∫–æ –µ –Ω—É–∂–Ω–æ)
‚òê –ü—Ä–æ–≤–µ—Ä–∏–ª —Å—ä–º —Ä–µ–¥–∞ –Ω–∞ –ø—Ä–∞–≤–∏–ª–∞—Ç–∞ (top-to-bottom)
‚òê –£–≤–µ—Ä–µ–Ω —Å—ä–º –≤ –ø–æ—Å–æ–∫–∞—Ç–∞ (in vs out)
‚òê –ó–∞ VTY: ACL –≤–∫–ª—é—á–≤–∞ –ú–û–Ø IP –∞–¥—Ä–µ—Å
‚òê –ì–æ—Ç–æ–≤ —Å—ä–º –¥–∞ –æ—Ç–º–µ–Ω—è –ø—Ä–æ–º–µ–Ω–∏—Ç–µ –∞–∫–æ –Ω–µ—â–æ —Å–µ –æ–±—ä—Ä–∫–∞
```

---

## –ë–™–†–ó–ê –ö–û–ú–ê–ù–î–ê –ó–ê –û–¢–ú–Ø–ù–ê –ù–ê ACL

```cisco
! –ü—Ä–µ–º–∞—Ö–≤–∞–Ω–µ –Ω–∞ ACL –æ—Ç –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å:
R1(config)# interface GigabitEthernet0/0.20
R1(config-subif)# no ip access-group 100 in
R1(config-subif)# exit

! –ò–∑—Ç—Ä–∏–≤–∞–Ω–µ –Ω–∞ —Ü–µ–ª–∏—è ACL:
R1(config)# no access-list 100
! –∏–ª–∏
R1(config)# no ip access-list extended IT_TO_ADMIN
```

---

## –ß–ê–°–¢ 8: Port Security –Ω–∞ Switch (BONUS) (10 –º–∏–Ω)

### –î–æ–ø—ä–ª–Ω–∏—Ç–µ–ª–Ω–∞ —Å–∏–≥—É—Ä–Ω–æ—Å—Ç –Ω–∞ Layer 2

Port Security **–æ–≥—Ä–∞–Ω–∏—á–∞–≤–∞ –∫–æ–∏ MAC –∞–¥—Ä–µ—Å–∏** –º–æ–≥–∞—Ç –¥–∞ —Å–µ —Å–≤—ä—Ä–∂–∞—Ç –∫—ä–º –ø–æ—Ä—Ç.

```cisco
SW1(config)# interface FastEthernet0/2
SW1(config-if)# switchport mode access
SW1(config-if)# switchport port-security
SW1(config-if)# switchport port-security maximum 2
SW1(config-if)# switchport port-security mac-address sticky
SW1(config-if)# switchport port-security violation restrict
SW1(config-if)# exit
```

### Violation modes:

| Mode | –ö–∞–∫–≤–æ –ø—Ä–∞–≤–∏ | –ö–æ–≥–∞ –¥–∞ –∏–∑–ø–æ–ª–∑–≤–∞–º |
|------|-------------|-------------------|
| **shutdown** | Shutdown-–≤–∞ –ø–æ—Ä—Ç–∞ (–ø–æ –ø–æ–¥—Ä–∞–∑–±–∏—Ä–∞–Ω–µ) | –°—Ç—Ä–æ–≥–∞ —Å–∏–≥—É—Ä–Ω–æ—Å—Ç |
| **restrict** | –ë–ª–æ–∫–∏—Ä–∞ —Ç—Ä–∞—Ñ–∏–∫–∞, –ª–æ–≥–≤–∞, –ù–ï shutdown | –°—Ä–µ–¥–Ω–∞ —Å–∏–≥—É—Ä–Ω–æ—Å—Ç |
| **protect** | –ë–ª–æ–∫–∏—Ä–∞ —Ç—Ä–∞—Ñ–∏–∫–∞, –ë–ï–ó –ª–æ–≥–æ–≤–µ | –ú–µ–∫–∞ —Å–∏–≥—É—Ä–Ω–æ—Å—Ç |

### –ü—Ä–æ–≤–µ—Ä–∫–∞:

```cisco
SW1# show port-security interface FastEthernet0/2
SW1# show port-security address
```

---

## –ó–ê–î–ê–ß–ò –ó–ê –°–ê–ú–û–°–¢–û–Ø–¢–ï–õ–ù–ê –†–ê–ë–û–¢–ê

### –ó–∞–¥–∞—á–∞ 1: –ë–ª–æ–∫–∏—Ä–∞–π –∫–æ–Ω–∫—Ä–µ—Ç–µ–Ω —Ö–æ—Å—Ç –∫—ä–º DNS

–°—ä–∑–¥–∞–π—Ç–µ Standard ACL, –∫–æ–π—Ç–æ –±–ª–æ–∫–∏—Ä–∞ PC4 (192.168.20.12) –¥–∞ –¥–æ—Å—Ç—ä–ø–≤–∞ DNS server (192.168.10.2).

**Hints:**
- –ò–∑–ø–æ–ª–∑–≤–∞–π Standard ACL (1-99)
- `deny host 192.168.20.12`
- –ù–ï –∑–∞–±—Ä–∞–≤—è–π `permit any`!
- –ü—Ä–∏–ª–æ–∂–∏ –Ω–∞ –ø—Ä–∞–≤–∏–ª–Ω–∏—è subinterface –∏ –ø–æ—Å–æ–∫–∞

---

### –ó–∞–¥–∞—á–∞ 2: –û–≥—Ä–∞–Ω–∏—á–∏ –ø—Ä–æ—Ç–æ–∫–æ–ª–∏

–°—ä–∑–¥–∞–π—Ç–µ Extended ACL –∫–æ–π—Ç–æ –ø–æ–∑–≤–æ–ª—è–≤–∞ –æ—Ç IT –∫—ä–º Admin:
- ‚úÖ ICMP (ping)
- ‚úÖ DNS (UDP port 53)
- ‚ùå –í—Å–∏—á–∫–æ –æ—Å—Ç–∞–Ω–∞–ª–æ

**Hints:**
- Extended ACL (100-199)
- `permit icmp ...`
- `permit udp ... eq 53`
- `deny ip ...`
- `permit ip any any` (–∑–∞ –¥—Ä—É–≥–∏—Ç–µ VLAN-–∏)

---

### –ó–∞–¥–∞—á–∞ 3: Multi-layer security

–ö–æ–º–±–∏–Ω–∏—Ä–∞–π—Ç–µ:
1. ACL –Ω–∞ router (inter-VLAN control)
2. Port security –Ω–∞ 2 switch –ø–æ—Ä—Ç–∞
3. SSH access control —Å–∞–º–æ –æ—Ç Admin VLAN

**–î–æ–∫—É–º–µ–Ω—Ç–∏—Ä–∞–π—Ç–µ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ –≤ —Ç–∞–±–ª–∏—Ü–∞!**

---

## –î–û–ö–£–ú–ï–ù–¢–ê–¶–ò–Ø –ó–ê –ü–†–û–ï–ö–¢–ê

### –¢–∞–±–ª–∏—Ü–∞ —Å ACL –ø—Ä–∞–≤–∏–ª–∞:

| ACL | –¢–∏–ø | –ò–º–µ/–ù–æ–º–µ—Ä | –î–µ–π—Å—Ç–≤–∏–µ | Source | Destination | Service | –ü—Ä–∏–ª–æ–∂–µ–Ω –Ω–∞ |
|-----|-----|-----------|----------|--------|-------------|---------|-------------|
| 1 | Standard | 10 | Deny | 192.168.10.12 | any | any | GigE0/0.10 out |
| 2 | Extended | 100 | Permit | 192.168.20.0/24 | 192.168.10.0/24 | HTTP/HTTPS | GigE0/0.20 in |
| 3 | Named | IT_TO_ADMIN | Permit | 192.168.20.0/24 | 192.168.10.0/24 | HTTP/HTTPS | GigE0/0.20 in |
| 4 | Standard | 50 | Permit | 192.168.10.0/24 | any | SSH | VTY 0-4 |

---

## BEST PRACTICES –ó–ê ACL

```
‚úÖ Extended ACL –±–ª–∏–∑–æ –¥–æ source (—Å–ø–∏—Ä–∞–º–µ —Ç—Ä–∞—Ñ–∏–∫–∞ —Ä–∞–Ω–æ)
‚úÖ Standard ACL –±–ª–∏–∑–æ –¥–æ destination
‚úÖ –í–∏–Ω–∞–≥–∏ –¥–æ–±–∞–≤—è–π—Ç–µ "permit any" (–∞–∫–æ –∏—Å–∫–∞—Ç–µ –¥–∞ —Ä–∞–∑—Ä–µ—à–∏—Ç–µ –æ—Å—Ç–∞–Ω–∞–ª–æ—Ç–æ)
‚úÖ –ò–∑–ø–æ–ª–∑–≤–∞–π—Ç–µ Named ACL (–ø–æ-—á–µ—Ç–ª–∏–≤–æ –∏ –ª–µ—Å–Ω–æ –∑–∞ —Ä–µ–¥–∞–∫—Ü–∏—è)
‚úÖ –î–æ–±–∞–≤—è–π—Ç–µ remark –∫–æ–º–µ–Ω—Ç–∞—Ä–∏
‚úÖ –¢–µ—Å—Ç–≤–∞–π—Ç–µ –ü–†–ï–î–ò production!
‚úÖ –î–æ–∫—É–º–µ–Ω—Ç–∏—Ä–∞–π—Ç–µ –≤ —Ç–∞–±–ª–∏—Ü–∞
‚úÖ –ó–∞–ø–∏—Å–≤–∞–π—Ç–µ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ —Å–ª–µ–¥ –ø—Ä–æ–º–µ–Ω–∏
‚úÖ –ü—Ä–æ–≤–µ—Ä—è–≤–∞–π—Ç–µ "(X matches)" –≤ show access-lists
```

---

## CHECKLIST –ó–ê –ó–ê–í–™–†–®–í–ê–ù–ï

```
‚òê Standard ACL —Å—ä–∑–¥–∞–¥–µ–Ω –∏ —Ç–µ—Å—Ç–≤–∞–Ω
‚òê Extended ACL —Å—ä–∑–¥–∞–¥–µ–Ω –∏ —Ç–µ—Å—Ç–≤–∞–Ω
‚òê Named ACL —Å—ä–∑–¥–∞–¥–µ–Ω –∏ —Ç–µ—Å—Ç–≤–∞–Ω
‚òê –†–∞–∑–±–∏—Ä–∞–º —Ä–∞–∑–ª–∏–∫–∞—Ç–∞ –º–µ–∂–¥—É IN –∏ OUT
‚òê –†–∞–∑–±–∏—Ä–∞–º wildcard masks (0.0.0.255 –∑–∞ /24)
‚òê –†–∞–∑–±–∏—Ä–∞–º implicit deny all
‚òê ACL –ø—Ä–∏–ª–æ–∂–µ–Ω –≤ –ø—Ä–∞–≤–∏–ª–Ω–∞ –ø–æ—Å–æ–∫–∞
‚òê SSH access control –∫–æ–Ω—Ñ–∏–≥—É—Ä–∏—Ä–∞–Ω
‚òê Port security —Ç–µ—Å—Ç–≤–∞–Ω (bonus)
‚òê Ping —Ç–µ—Å—Ç–æ–≤–µ—Ç–µ –ø–æ—Ç–≤—ä—Ä–∂–¥–∞–≤–∞—Ç permit –ø—Ä–∞–≤–∏–ª–∞—Ç–∞
‚òê Ping —Ç–µ—Å—Ç–æ–≤–µ—Ç–µ –ø–æ—Ç–≤—ä—Ä–∂–¥–∞–≤–∞—Ç deny –ø—Ä–∞–≤–∏–ª–∞—Ç–∞
‚òê ACL –ø—Ä–∞–≤–∏–ª–∞—Ç–∞ –¥–æ–∫—É–º–µ–Ω—Ç–∏—Ä–∞–Ω–∏ –≤ —Ç–∞–±–ª–∏—Ü–∞
‚òê –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è—Ç–∞ –µ –∑–∞–ø–∞–∑–µ–Ω–∞
```

---

## –ö–ê–ö–í–û –ù–ê–£–ß–ò–•–ú–ï

1. ‚úÖ –©–æ –µ —Ç–æ ACL (–∞–Ω–∞–ª–æ–≥–∏—è —Å –æ—Ö—Ä–∞–Ω–∏—Ç–µ–ª –Ω–∞ –Ω–æ—â–µ–Ω –∫–ª—É–±)
2. ‚úÖ Standard vs Extended ACL (—Ä–∞–∑–ª–∏–∫–∏ –∏ –∫–æ–≥–∞ –¥–∞ –∏–∑–ø–æ–ª–∑–≤–∞–º–µ)
3. ‚úÖ Wildcard mask (–æ–±—Ä–∞—Ç–Ω–æ—Ç–æ –Ω–∞ subnet mask)
4. ‚úÖ ACL processing (top-to-bottom, first match wins)
5. ‚úÖ Implicit deny all (–Ω–µ–≤–∏–¥–∏–º–æ—Ç–æ –ø—Ä–∞–≤–∏–ª–æ –≤ –∫—Ä–∞—è)
6. ‚úÖ IN vs OUT direction (–∫—ä–¥–µ –¥–∞ –ø—Ä–∏–ª–æ–∂–∏–º ACL)
7. ‚úÖ Named ACL (–º–æ–¥–µ—Ä–µ–Ω –∏ –ø—Ä–µ–ø–æ—Ä—ä—á–∏—Ç–µ–ª–µ–Ω –ø–æ–¥—Ö–æ–¥)
8. ‚úÖ VTY access control (SSH security)
9. ‚úÖ Port security (Layer 2 –∑–∞—â–∏—Ç–∞)
10. ‚úÖ Troubleshooting ACL (show commands, debug)

---

## –ë–™–†–ó–ò –ö–û–ú–ê–ù–î–ò –ó–ê REFERENCE

### Standard ACL:
```cisco
access-list 10 deny host 192.168.10.11
access-list 10 permit any
interface GigE0/0.20
 ip access-group 10 out
```

### Extended ACL:
```cisco
access-list 100 permit tcp 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255 eq 80
access-list 100 deny ip 192.168.20.0 0.0.0.255 192.168.10.0 0.0.0.255
access-list 100 permit ip any any
interface GigE0/0.20
 ip access-group 100 in
```

### Named ACL:
```cisco
ip access-list extended WEB_ACCESS
 remark Allow HTTP and HTTPS only
 permit tcp any any eq 80
 permit tcp any any eq 443
 deny ip any any
interface GigE0/0.20
 ip access-group WEB_ACCESS in
```

### VTY Access:
```cisco
access-list 50 permit 192.168.10.0 0.0.0.255
access-list 50 deny any
line vty 0 4
 access-class 50 in
```

### Port Security:
```cisco
interface Fa0/2
 switchport mode access
 switchport port-security
 switchport port-security maximum 2
 switchport port-security mac-address sticky
 switchport port-security violation restrict
```

### Show Commands:
```cisco
show access-lists                    ! –í—Å–∏—á–∫–∏ ACL-–∏
show ip interface GigE0/0.20         ! ACL –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å
show port-security interface Fa0/2   ! Port security —Å—Ç–∞—Ç—É—Å
show port-security address           ! –ù–∞—É—á–µ–Ω–∏ MAC –∞–¥—Ä–µ—Å–∏
```

---

## –°–õ–ï–î–í–ê–©–ê –°–¢–™–ü–ö–ê

–í **Lab 6** —â–µ –∏–Ω—Ç–µ–≥—Ä–∏—Ä–∞–º–µ:
- IoT —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ (sensors, actuators)
- –ê–≤—Ç–æ–º–∞—Ç–∏–∑–∞—Ü–∏—è —Å Blockly/Python
- Smart Home/Office —Å—Ü–µ–Ω–∞—Ä–∏–∏

**–¢–æ–≤–∞ –µ —Ñ–∏–Ω–∞–ª–Ω–∞—Ç–∞ —Å—Ç—ä–ø–∫–∞ –ø—Ä–µ–¥–∏ –∫—É—Ä—Å–æ–≤–∏—è –ø—Ä–æ–µ–∫—Ç!**

**–ó–∞–ø–∞–∑–µ—Ç–µ —Ñ–∞–π–ª–∞ –∫–∞—Ç–æ:** `Lab5_ACL_YourName.pkt`

---

**–£—Å–ø–µ—Ö —Å –ª–∞–±–∞! ACL-–∏—Ç–µ —Å–∞ –º–æ—â–µ–Ω –∏–Ω—Å—Ç—Ä—É–º–µ–Ω—Ç –∑–∞ –º—Ä–µ–∂–æ–≤–∞ —Å–∏–≥—É—Ä–Ω–æ—Å—Ç! üîí**


<script data-goatcounter="https://satanasov.goatcounter.com/count"
        async src="//gc.zgo.at/count.js"></script>

<script src="/SNA/assets/js/analytics-logger.js"></script>
